Tekla.Structures.Model.Welding.WeldGeometry
Class that represents weld seam specific geometry.
using System.Collections;
using System.Text;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.Model.Welding;
public class Example
{
private static Model _teklaModel;
private Model TeklaModel
{
get
{
if (_teklaModel == null)
{
_teklaModel = new Model();
}
return _teklaModel;
}
}
public void Example1()
{
ModelObjectEnumerator weldEnumerator =
TeklaModel.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.WELD);
Weld weld = null;
while (weldEnumerator.MoveNext())
{
weld = weldEnumerator.Current as Weld;
if (weld != null)
{
break;
}
}
if (weld != null)
{
ArrayList weldGeometries = weld.GetWeldGeometries();
StringBuilder sb = new StringBuilder();
foreach (WeldGeometry weldGeometry in weldGeometries)
{
if (weldGeometry != null)
{
int polygonIndex = 1;
sb.AppendLine(weldGeometry.Position.ToString());
foreach (Polygon polygon in weldGeometry.Polygons)
{
if (polygon != null)
{
sb.AppendLine("Polygon: " + polygonIndex);
if (polygon.Points != null)
{
foreach (Point point in polygon.Points)
{
if (point != null)
{
sb.AppendLine(point.ToString());
}
}
}
}
polygonIndex++;
}
}
sb.AppendLine();
sb.AppendLine();
}
// Print the string builder content to the desired place by calling sb.ToString();
}
}
}

Tekla.Structures.Model.Welding.WeldGeometry.position
Weld seam position.

Tekla.Structures.Model.Welding.WeldGeometry.polygons
Weld seam polygons.

Tekla.Structures.Model.Welding.WeldGeometry.#ctor
Initializes a new instance of the Tekla.Structures.Model.Welding.WeldGeometry class.

Tekla.Structures.Model.Welding.WeldGeometry.#ctor(Tekla.Structures.Model.Welding.WeldSeamPositionEnum)
Initializes a new instance of the Tekla.Structures.Model.Welding.WeldGeometry class.
position: Weld seam position (above or below).

Tekla.Structures.Model.Welding.WeldGeometry.Position
Gets the weld seam position (above or below).

Tekla.Structures.Model.Welding.WeldGeometry.Polygons
Gets the weld seam specific ArrayList of Tekla.Structures.Model.Polygon objects.

Tekla.Structures.Model.Welding.WeldGeometry.GetWeldGeometries(Tekla.Structures.Identifier)
Method for getting weld geometries.
Every result represents one individual seam geometry in current weld.
weldId: Weld identifier.
Returns: An array list that contains weld specific WeldGeometry objects.

Tekla.Structures.Model.Welding.WeldGeometry.GetWeldGeometry(Tekla.Structures.Identifier,Tekla.Structures.Model.Welding.WeldSeamPositionEnum)
Method for getting weld seam specific geometry.
weldId: Weld identifier.
seamPosition: Weld seam position (above or below).
Returns: An instance of the Tekla.Structures.Model.Welding.WeldGeometry class.

Tekla.Structures.Model.Welding.WeldGeometry.CreateWeldGeometryPolygon(System.Collections.Generic.IList{Tekla.Structures.ModelInternal.dotWeldGeometry_t})
Method for creating weld geometry polygon out of weld geometry structs.
weldGeometryStructs: Seam specific list of weld geometry structs.
Returns: An instance of the Tekla.Structures.Model.Polygon class.